In [27]:
import pandas as pd
import matplotlib.pyplot as plt

In [28]:
gender_submission = pd.read_csv('gender_submission.csv')

In [29]:
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [30]:
gender_submission.shape

(418, 2)

In [31]:
test_data = pd.read_csv('test.csv')

In [32]:
test_data.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [33]:
test_data.shape

(418, 11)

In [34]:
test_data.PassengerId.dtype, gender_submission.PassengerId.dtype

(dtype('int64'), dtype('int64'))

In [35]:
# Merge 'test_data' and 'gender_submission' using a left join
all_data = pd.merge(left=test_data, right=gender_submission, left_on='PassengerId', right_on='PassengerId', how='left')

In [36]:
all_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [37]:
all_data.set_index('PassengerId').head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [67]:
print(all_data[all_data.Survived == 1].PassengerId.count())

152

In [39]:
print(all_data[all_data.Survived == 0].PassengerId.count())

266

In [40]:
all_data.groupby(['Survived','Sex']).count()

,,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Survived,Sex,,,,,,,,,,
0,male,266,266,266,205,266,266,266,265,47,266
1,female,152,152,152,127,152,152,152,152,44,152

In [41]:
plec = all_data[['Survived','Sex']]
plec.head()

   Survived     Sex
0         0    male
1         1  female
2         0    male
3         0    male
4         1  female

In [42]:
plec.groupby('Sex').sum()

        Survived
Sex
female       152
male           0

In [45]:
all_data.groupby(['Pclass','Sex']).Survived.sum()

Pclass  Sex
1       female    50
        male       0
2       female    30
        male       0
3       female    72
        male       0
Name: Survived, dtype: int64

In [68]:
all_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [46]:
all_data.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000,418.000000
mean,1100.500000,2.265550,30.272590,0.447368,0.392344,35.627188,0.363636
std,120.810458,0.841838,14.181209,0.896760,0.981429,55.907576,0.481622
min,892.000000,1.000000,0.170000,0.000000,0.000000,0.000000,0.000000
25%,996.250000,1.000000,21.000000,0.000000,0.000000,7.895800,0.000000
50%,1100.500000,3.000000,27.000000,0.000000,0.000000,14.454200,0.000000
75%,1204.750000,3.000000,39.000000,1.000000,0.000000,31.500000,1.000000
max,1309.000000,3.000000,76.000000,8.000000,9.000000,512.329200,1.000000

In [66]:
all_data.groupby(['Survived','Sex','Pclass']).Name.count()

Survived  Sex     Pclass
0         male    1          57
                  2          63
                  3         146
1         female  1          50
                  2          30
                  3          72
Name: Name, dtype: int64

In [64]:
all_data.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
Survived         int64
dtype: object